app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
SELECT COUNT(*) FROM "votes" WHERE "votes"."topic_id" = ?  [["topic_id", 1]]
---
  def index
    @topics = Topic.all.sort_by { |topic| topic.votes.count }.reverse

INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 19 Oct 2013 18:09:51 UTC +00:00], ["description", "Rails is great!"], ["title", "Ruby on Rails"], ["updated_at", Sat, 19 Oct 2013 18:09:51 UTC +00:00]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_topic
      @topic = Topic.find(params[:id])