app/controllers/votes_controller.rb

  def create
    topic = Topic.find(params[:topic_id])
    vote = topic.votes.build
    vote.save!
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? ORDER BY "topics"."id" ASC LIMIT 1  [["id", 3]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 19 Oct 2013 20:20:17 UTC +00:00], ["topic_id", 1], ["updated_at", Sat, 19 Oct 2013 20:20:17 UTC +00:00]]

  def destroy
    topic = Topic.find(params[:topic_id])
    vote = topic.votes.first.delete unless topic.votes.first == nil
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "votes" WHERE "votes"."id" = 7
SELECT "votes".* FROM "votes" WHERE "votes"."topic_id" = ? ORDER BY "votes"."id" ASC LIMIT 1  [["topic_id", 2]]